Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: The comma preceding an optional parameter can also be omitted if all subsequent parameters are omitted.
fr: La virgule avant un paramètre facultatif peut aussi être omise si tous les paramètres suivants sont omis.

source: The comma separating the command name from its parameters is optional, except in the following cases:
fr: La virgule séparant le nom de la commande des paramètres est optionnelle, sauf dans les cas suivants :

source: The commands #NoTrayIcon and "Menu, Tray, ShowMainWindow" affect the behavior of compiled scripts.
fr: Les commandes #NoTrayIcon et "Menu, Tray, ShowMainWindow" affectent le comportement des scripts compilés.

source: The compilation process creates an executable file which contains the following:
fr: Le processus de compilation créé un fichier exécutable qui contient :

source: The compiler can be run from the command line with the following parameters:
fr: Le compilateur peut être exécuté depuis la ligne de commande avec les paramètres suivants :

source: The compiler's source code and newer versions can be found at GitHub.
fr: Le code source du compilateur et des versions plus récentes peuvent être trouvées sur GitHub.

source: The current user's Documents folder.
fr: Le dossier Documents de l'utilisateur actuel.

source: The default behavior of a continuation section can be overridden by including one or more of the following options to the right of the section's opening parenthesis.
fr: Le comportement par défaut d'une section de continuation peut être modifié en incluant une ou plus des options suivantes à droite de la parenthèse ouvrante de la section.

source: The default comment character (semicolon) can be changed to some other character or string via #CommentFlag.
fr: Le caractère par défaut de commentaire (point-virgule) peut être remplacé par un autre caractère ou par une chaîne de caractère via #CommentFlag.

source: The default title is equivalent to the expression A_ScriptFullPath (A_IsCompiled ? "" : " - AutoHotkey v" A_AhkVersion).
fr: Le titre par défaut est équivalent à l'expression A_ScriptFullPath (A_IsCompiled ? "" : " - AutoHotkey v" A_AhkVersion).

source: The difference between the two examples is that the hotkey will be triggered when you press Ctrl+J while the hotstring will convert your typed "ftw" into "Free the whales".
fr: La différence entre les deux exemples est que la hotkey est activée quand Ctrl+J est enfoncé alors que le hotstring convertira un "ftw" frappé en "Free the whales".

source: The directory where you installed AutoHotkey, usually C:\Program Files\AutoHotkey.
fr: Le dossier où AutoHotkey est installé, en général C:\Program Files\AutoHotkey.

source: The directory which contains the AutoHotkey executable.
fr: Le dossier qui contient l'exécutable AutoHotkey.

source: The easiest is to place a shortcut to the script in the Startup folder:
fr: Le plus simple est de placer un raccourci vers le script dans le menu Démarrage :

source: The effect is similar to using #Include at the end of the main script file.
fr: L'effet est semblable à l'utilisation de #Include à la fin du fichier de script principal.

source: The equal sign (when not used with another symbol, such as <=) has the following meanings:
fr: Le signe égal (quand il n'est pas utilisé avec un autre symbole, tel que <=) a les significations suivantes :

source: The exact usage of a parameter is described in the Parameters section, and varies between commands.
fr: L'utilisation exacte d'un paramètre est décrite dans la section Paramètres, et varie entre les commandes.

source: The expression is evaluated after each iteration.
fr: L'expression est évaluée après chaque itération.

source: The expression is evaluated before each iteration.
fr: L'expression est évaluée avant chaque itération.

source: The file AutoHotkey.exe is all that is needed to launch any .ahk script.
fr: Le fichier AutoHotkey.exe est tout ce qui est nécessaire pour lancer n'importe quel script .ahk.

source: The filename AutoHotkey.ahk depends on the name of the executable used to run the script.
fr: Le nom de fichier AutoHotkey.ahk dépend du nom de l'exécutable utilisé pour lancer le script.

source: The first line:
fr: La première ligne :

source: The first two cases can be avoided by always using the := assignment operator and if (expression).
fr: Les deux premiers cas peuvent être évités en utilisant toujours l'opérateur d'affectation := et if (expression).

source: The following "legacy" named If statements also exist:
fr: Les instructions If nommées "dépassées" (legacy) suivantes existent également :

source: The following commands are also useful for debugging:
fr: Les commandes suivantes sont aussi utiles pour le débogage :

source: The following control flow statements exist:
fr: Les instructions de flux de contrôle suivantes existent :

source: The following errors are detected immediately upon launching a script in AutoHotkey_L, and must be corrected for the script to run:
fr: Les erreurs suivantes sont détectées immédiatement lors du lancement d'un script dans AutoHotkey_L et doivent être corrigées pour que le script s'exécute:

source: The following example creates a pseudo-array with elements "Left", "Top", "Right" and "Bottom":
fr: L'exemple suivant créé un pseudo-tableau avec les éléments "Left", "Top", "Right" et "Bottom":

source: The following example exits the script when too few parameters are passed to it:
fr: L'exemple suivant termine le script quand un nombre insuffisant de paramètres lui est passé :

source: The following example subtracts 7 days from the specified time:
fr: L'exemple suivant soustrait 7 jours (days) du temps indiqué :

source: The following function can be used for this purpose:
fr: La fonction suivante peut être utilisée à cet effet:

source: The following is a last resort and generally should be attempted only in desperation.
fr: Ce qui suit est un dernier recours et ne doit généralement être tenté qu'en cas de désespoir.

source: The following related statements are also grouped with each other, along with their bodies:
fr: Les instructions associées suivantes sont aussi regroupées ensemble, ainsi qu'avec leurs corps :

source: The following types of expressions can be used as statements:
fr: Les types d'expression suivants peuvent être utilisés comme instructions :

source: The format is:
fr: La syntaxe est :

source: The fourth button (XButton1) and the fifth button (XButton2) might be assignable if your mouse driver allows their clicks to be seen by the system.
fr: Le quatrième bouton (XButton1) et le cinquième bouton (XButton2) peuvent être utilisables si le pilote de la souris autorise que leurs clics soient visibles par le système.

source: The function assigned to each of the keys listed below can be overridden by modifying the Windows registry.
fr: La fonction attribuée à chacune des touches dans la liste ci-dessous peut être remplacée en modifiant le registre Windows.

source: The function can return a value.
fr: La fonction peut renvoyer une valeur.

source: The inputs of a function are called parameters or arguments.
fr: Les entrées d'une fonction sont appelées paramètres ou arguments.

source: The installer GUI has an option "Add 'Run with UI Access' to context menus".
fr: L'interface graphique de l'installateur a une option "Add 'Run with UI Access' to context menus" (Ajouter 'Lancer avec accès UI' aux menus contextuels).

source: The key or key combo needs to go on the left of the ::.
fr: La touche ou le combo de touches doit aller à gauche de ::.

source: The left and right mouse buttons should be assignable normally (for example, #LButton:: is the Win+LeftButton hotkey).
fr: Les boutons gauche et droit de la souris devrait être utilisables normalement (par exemple, #LButton:: est la hotkey Win+BoutonGauche).

source: The left mouse button when used with Send, but the primary mouse button when used with hotkeys.
fr: Le bouton gauche de la souris lorsqu'il est utilisé avec Send, mais le bouton principal de la souris lorsqu'il est utilisé avec des hotkeys.

source: The line break between the close-parenthesis and open-brace is optional.
fr: Le retour à la ligne entre la parenthèse fermante et l'accolade ouvrante est facultatif.

source: The method above can also be used to change existing icons or add new ones to all compiled scripts.
fr: La méthode ci-dessus peut aussi être utilisée pour changer des icônes existantes ou en ajouter à tout script compilé.

source: The most common form of dynamic variable reference is called a double reference or double-deref.
fr: La forme la plus courante de référence dynamique de variable est appelée une double référence ou double-déréf.

source: The most common way assigning the value of a function to a variable is like so:
fr: La manière la plus répandue d'assigner la valeur d'une fonction à une variable est la suivante :

source: The mysterious square brackets
fr: Les mystérieux crochets

source: The name of the joystick or its driver.
fr: Le nom du joystick ou de son pilote.

source: The names of the letter and number keys are the same as that single letter or digit.
fr: Les noms des touches de saisie de texte (alphabétiques et numériques) sont les mêmes que la lettre ou le chiffre comme tel.

source: The number of axes supported by the joystick.
fr: Le nombre d'axes supportés par le joystick.

source: The number of buttons supported by the joystick (not always accurate).
fr: Le nombre de boutons pris en charge par le joystick (pas toujours précis).

source: The opening brace of a block can be written at the end of the same line as an If (expression), Else, Loop Count, While, For, Try, Catch or Finally statement (basically any control flow statement which does not use legacy syntax).
fr: L'accolade ouvrante d'un bloc peut être écrite à la fin de la même ligne qu'une instruction If (expression), Else, Loop Count, While, For, Try, Catch ou Finally (c'est-à-dire n'importe quelle instruction de flux de contrôle qui n'utilise pas la syntaxe dépassée (legacy)).

source: The operators := and = are interchangeable for historical reasons, but it is best to use := for consistency with assignment in expressions.
fr: Les opérateurs := et = sont interchangeables pour des raisons historiques, mais il est mieux d'utiliser := pour la cohérence avec l'affectation par expression.

source: The piecemeal construction of a continuation section by means of #Include is not supported.
fr: La construction par morceaux d'une section de continuation en utilisant #Include n'est pas prise en charge.

source: The point-of-view (hat) control.
fr: Le contrôle du point-de-vue (chapeau).

source: The preferred method is #IfWinActive.
fr: La méthode recommandée est #IfWinActive.

source: The previous value of MyObject[AnyKey] will be stored in RemovedValue.
fr: La valeur précédente de MonObjet[UneClef] sera stockée dans ValeurEnlevee.

source: The process exit code can be used to detect this condition; if there is a syntax error, the exit code is 2.
fr: Le code de sortie du processus peut être utilisé pour détecter ce cas ; s'il y a une erreur de syntaxe, le code de sortie est 2.

source: The process of finding out the value of an expression is called evaluation.
fr: Le processus de trouver la valeur d'une expression est appelé évaluation.

source: The program loads the script into memory line by line, and each line may be up to 16,383 characters long.
fr: Le programme charge le script en mémoire ligne par ligne, et chaque ligne peut être constituée d'au maximum 16383 caractères.

source: The requirement for backward-compatibility does not apply to these control flow statements as they are relatively new.
fr: Le besoin de compatibilité avec les anciennes versions ne s'applique pas à ces instructions de flux de contrôle puisqu'elles sont relativement nouvelles.

source: The right mouse button when used with Send, but the secondary mouse button when used with hotkeys.
fr: Le bouton droit de la souris lorsqu'il est utilisé avec Send, mais le bouton secondaire de la souris lorsqu'il est utilisé avec des hotkeys.

source: The rudder or 4th axis of the joystick.
fr: Le gouvernail ou le 4ème axe du joystick.

source: The same as above but with the dot notation.
fr: Comme ci-dessus mais avec la notation point.

source: The script only has one auto-execute section, not one per file.
fr: Le script n'a qu'une seule section d'auto-exécution, et pas une par fichier.

source: The script will always exit, even if MyVar is not 5:
fr: Le script sera toujours quitté, même si MaVar ne vaut pas 5 :

source: The script will then continue until reaching the next "break point" (if any).
fr: Le script continuera ensuite jusqu'à atteindre le prochain "point d'arrêt" (s'il y en a un).

source: The script's main window is usually hidden, but can be shown via the tray icon or one of the commands listed below to gain access to information useful for debugging the script.
fr: La fenêtre principale du script est en général cachée, mais peut être affichée via l'icône de zone de notification ou une des commandes listées ci-dessous pour accéder à des informations utiles au débogage du script.

source: The script's own windows can't be automated by non-UIA programs/scripts for security reasons.
fr: Pour des raisons de sécurité, les fenêtres propres au script ne peuvent pas être automatisées par des programmes ou scripts non-UIA.

source: The second line:
fr: La deuxième ligne :

source: The set of available commands is predefined and cannot be changed by the script.
fr: L'ensemble des commandes disponibles est prédéfini et ne peut pas être changé par le script.

source: The setting may be turned off via #LTrim Off.
fr: L'option peut être désactivée avec #LTrim Off.

source: The shortcut to the script should now be in the Startup folder.
fr: Le raccourci vers le script devrait maintenant être dans le dossier Démarrage.

source: The simplest way to remove a value is to just blank it out.
fr: La manière la plus simple d'enlever une valeur est de la modifier en valeur vide,

source: The square brackets denote optional parameters; the brackets themselves must be omitted from the actual code.
fr: Les crochets indiquent des paramètres facultatifs ; les crochets eux-mêmes ne sont pas à inclure dans le code.

source: The start and end of a continuation section are marked with ( and ) (both symbols must appear at the beginning of a line, excluding whitespace).
fr: Le début et la fin d'une section de continuation sont marqués par ( et ) (les deux symboles doivent apparaître au début d'une ligne, sauf espacement).

source: The syntax consists of command and variable names, unquoted text and a few symbols such as ,, = and %.
fr: La syntaxe consiste en les noms de la commande et de variables, du texte sans guillemets et quelques symboles tels que ,, = et %.

source: The third line:
fr: La troisième ligne :

source: The title of this window is used by the #SingleInstance and Reload mechanisms to identify other instances of the same script.
fr: Le titre de cette fenêtre est utilisé par les mécanismes de #SingleInstance et Reload pour identifier les différentes instances d'un même script.

source: The tray icon usually looks like this (but the color or letter changes when the script is paused or suspended):
fr: Cette icône est d'habitude semblable à celle-ci (mais la couleur ou la lettre change quand le script est en pause ou suspendu) :

source: The use of #Include in the script's auto-execute section requires special consideration, because the auto-execute section is essentially just a subroutine.
fr: L'utilisation de #Include dans la section d'auto-exécution du script requiert une attention particulière, car la section d'auto-exécution est essentiellement un simple sous-programme.

source: The use of the `" escape sequence to produce a literal quote-character is currently not supported; instead, use two consecutive quotes as shown above.
fr: L'utilisation de la séquence échappée `" pour produire un caractère guillemet littéral est actuellement non prise en charge ; à la place, utiliser deux guillemets consécutifs comme montré ci-dessus.

source: The value it gives will be the number of keys that were removed, which is useful if you have a gap between your keys (e.g. you specify keys 1 through four, but key number 2 doesn't exist, this will set NumberOfRemovedKeys to 3 as only three keys were there to be removed).
fr: La valeur renvoyée est le nombre de clés enlevées, ce qui est utile s'il y a un trou entre les clés (par exemple enlever les clés de 1 à 4, mais la clé numéro 2 n'existe pas, NombreDeClefsEnlevees sera défini à 3 puisqu'il n'y avait que trois clés à enlever).

source: The variable names are known as "Keys", and the contents of the variables are "Values".
fr: Les noms des variables sont appelés "Clés" (keys), et les contenus des variables "Valeurs" (values).

source: The variables %1%, %2%, etc. contain the incoming parameters.
fr: contiennent les paramètres d'entrée.

source: Their values always correspond to the most recently started (but not yet stopped) loop of the appropriate type.
fr: Leurs valeurs correspondent toujours à la boucle entamée le plus récemment (mais pas encore terminée) du type approprié.

source: Then try running it again.
fr: S'il y a encore une erreur,

source: Then try to fix your code.
fr: Puis le réessayer.

source: Then, study the code.
fr: Ensuite, d'étudier le code.

source: There are a couple of common ways to create a script file:
fr: Il y a différentes façons usuelles de créer un fichier de script :

source: There are a few ways to create an object, and the most common ones are listed below:
fr: Il y a plusieurs manières de créer un objet, les plus courantes sont listées ci-dessous :

source: There are a few ways to do this, I'll assume you have it installed to the default locations:
fr: Il y a plusieurs manières de faire, ce tutoriel suppose qu'il est installé à l'endroit par défaut :

source: There are a number of reasons you might want to use an object for something.
fr: Il y a un certain nombre de raisons pour lesquelles l'usage d'un objet est souhaitable.

source: There are also known issues with DirectX.
fr: Il y a aussi des problèmes avec DirectX.

source: There are also several other control flow statements (such as loops) which use legacy syntax similar to commands.
fr: Il y a plusieurs autres instructions de contrôle de flux (comme les boucles) qui utilisent également la syntaxe dépassée (legacy) similaire aux commandes.

source: There are also user-created solutions such as OnWin.ahk and [How to] Hook on to Shell to receive its messages.
fr: Il y a aussi des solutions créées par des utilisateurs, comme OnWin.ahk et [How to] Hook on to Shell to receive its messages ([Comment faire] Passer par le Shell pour recevoir ses messages).

source: There are four types of parameters:
fr: Il y a quatre types de paramètres :

source: There are many variations of this problem, such as:
fr: Il y a beaucoup de variations de ce problème, comme :

source: There are many ways to use objects, including retrieving values, setting values, adding more values, and more.
fr: Il y a plein de manières d'utiliser les objets, y compris récupérer des valeurs, en définir, ajouter plus de valeurs, et bien plus.

source: There are no keys higher than it to be affected.
fr: Il n'y a pas de clé plus grande à impacter.

source: There are no restrictions to what a key or value can be, and they can even be other arrays!
fr: Il n'y a pas de restrictions sur ce que peut être une clé ou une valeur, elles peuvent même être des tableaux !

source: There are other symbols used in expressions which don't quite fit into any of the categories defined above, or that affect the meaning of other parts of the expression, as described below.
fr: Il y a d'autres symboles utilisés dans les expressions qui n'ont pas tout à fait leur place dans les catégories définies précédemment, ou qui changent le sens d'autres morceaux d'une expression, comme décrit ci-dessous.

source: There are several commands which create associative pseudo-arrays:
fr: Plusieurs commandes créent des pseudo-tableaux associatifs :

source: There are several types of If statement, with each having different syntax.
fr: Il y a plusieurs types d'instruction If, chacune ayant une syntaxe différente.

source: There are several types of loop statements:
fr: Il y a plusieurs types d'instructions de boucle :

source: There are several ways of doing this, but the simplest way is InputBox.
fr: Il y a plusieurs manières de faire, mais la plus simple est InputBox.

source: There are several ways to make a script (or any program) launch automatically every time you start your PC.
fr: Il y a plusieurs manières pour qu'un script (ou n'importe quel programme) se lance automatiquement à chaque démarrage.

source: There are some other advanced features as well, such as command line parameters and CLSID.
fr: Il y a aussi d'autres fonctionnalités avancées, comme les paramètres de ligne de commande et CLSID.

source: There are three kinds of label:
fr: Il y a trois types de labels :

source: There are two distinct styles of syntax used in AutoHotkey:
fr: Il y a deux styles distincts de syntaxe utilisés dans AutoHotkey :

source: There are two methods:
fr: Il y a deux méthodes :

source: There are two ways to concatenate values in an expression:
fr: Il y a deux façons de concaténer des valeurs dans une expression :

source: There can be any amount of whitespace or comments between the two.
fr: Il peut y avoir une quantité quelconque d'espacements ou de commentaires entre les deux.

source: There is no single solution to make AutoHotkey work in all programs.
fr: Il n'y a pas de solution unique pour que AutoHotkey fonctionne dans tous les programmes.

source: These all relate to objects in some way.
fr: Ceux-ci sont tous reliés d'une façon ou d'une autre aux objets.

source: These are called quoted strings.
fr: et est appelé chaîne entre guillemets.

source: These are some common points of confusion related to legacy If statements:
fr: Il y a des points communs entre les confusions dues aux instructions If dépassées (legacy) :

source: These can be used as hotkeys with some (but not all) mice which have a second wheel or support tilting the wheel to either side.
fr: Ceux-ci peuvent être utilisés comme hotkey avec certaines souris (mais pas toutes) qui ont une deuxième roulette ou qui supportent l'inclinaison de la roulette de chaque côté.

source: These cause an error message to be displayed prior to exiting the current thread:
fr: Celles-ci provoquent l'affichage d'un message d'erreur avant de quitter le thread actuel:

source: These error codes can be found at GitHub (ErrorCodes.md).
fr: Ces codes d'erreur peuvent être trouvés ici : GitHub (ErrorCodes.md).

source: These lines are written in the following format, where LibDir is the full path of the Lib folder and LibFile is the filename of the library:
fr: Ces lignes sont écrites dans la syntaxe suivante, où DossierBibli est le chemin complet du dossier de la bibliothèque et FichierBibli est le nom de fichier de la bibliothèque :

source: These should be avoided in new scripts.
fr: Ils devraient être évités dans de nouveaux scripts.

source: These special commands (technically called "directives") create context-sensitive hotkeys and hotstrings.
fr: Ces commandes spéciales (de nom technique "directives") créent des hotkeys et hotstrings sensibles au contexte.

source: These variables have names beginning with A_Loop, such as A_LoopFileName and A_LoopReadLine.
fr: Ces variables ont des noms commençant par A_Loop, comme A_LoopFileName et A_LoopReadLine.
